{"<pad>": 0, "<unk>": 1, "what": 2, "is": 3, "aã§aã­": 4, "berries": 5, "tell": 6, "me": 7, "about": 8, "acorn": 9, "squash": 10, "something": 11, "adzuki": 12, "beans": 13, "who": 14, "alcohol": 15, "algae": 16, "almond": 17, "milk": 18, "almonds": 19, "anchovies": 20, "apples": 21, "apricots": 22, "arctic": 23, "char": 24, "artichokes": 25, "arugula": 26, "asparagus": 27, "autumn": 28, "crocus": 29, "avocado": 30, "oil": 31, "avocados": 32, "bacon": 33, "balsamic": 34, "vinegar": 35, "bananas": 36, "barbecued": 37, "meat": 38, "basil": 39, "bean": 40, "curd": 41, "beef": 42, "beer": 43, "beets": 44, "bell": 45, "peppers": 46, "bitter": 47, "apple": 48, "cucumber": 49, "gourd": 50, "melon": 51, "black": 52, "cumin": 53, "currants": 54, "pepper": 55, "rice": 56, "tea": 57, "blackberries": 58, "blackstrap": 59, "molasses": 60, "blue-green": 61, "blueberries": 62, "bok": 63, "choy": 64, "boysenberries": 65, "bran": 66, "brazil": 67, "nuts": 68, "bread": 69, "broccoli": 70, "sprouts": 71, "brown": 72, "mustard": 73, "syrup": 74, "brussels": 75, "buckwheat": 76, "honey": 77, "butter": 78, "butternut": 79, "cabbage": 80, "cactus": 81, "pears": 82, "canola": 83, "cantaloupe": 84, "carrots": 85, "cashews": 86, "cauliflower": 87, "caviar": 88, "cayenne": 89, "celeriac": 90, "celery": 91, "seed": 92, "chamomile": 93, "cheese": 94, "cherries": 95, "chicken": 96, "chickpeas": 97, "chili": 98, "powder": 99, "chilli": 100, "chinese": 101, "red": 102, "yeast": 103, "chives": 104, "chocolate": 105, "cilantro": 106, "cinnamon": 107, "clams": 108, "clementines": 109, "coconut": 110, "coffee": 111, "collard": 112, "greens": 113, "corn": 114, "crab": 115, "cranberries": 116, "cream": 117, "crimini": 118, "mushrooms": 119, "cucumbers": 120, "curcumin": 121, "cured": 122, "meats": 123, "daidzein": 124, "dal": 125, "dill": 126, "dried": 127, "herring": 128, "mackerel": 129, "dry": 130, "edamame": 131, "eggs": 132, "equol": 133, "escargot": 134, "essiacâ„¢": 135, "fennel": 136, "fermented": 137, "paste": 138, "flaxseed": 139, "fried": 140, "potatoes": 141, "garbanzo": 142, "garden": 143, "cress": 144, "garlic": 145, "genistein": 146, "ghee": 147, "ginger": 148, "grape": 149, "grapefruit": 150, "grapes": 151, "gravy": 152, "green": 153, "onions": 154, "papaya": 155, "peas": 156, "guacamole": 157, "halibut": 158, "ham": 159, "hearts": 160, "of": 161, "palm": 162, "holy": 163, "honeydew": 164, "horseradish": 165, "hot": 166, "sauce": 167, "hummus": 168, "indian": 169, "kale": 170, "kefir": 171, "kelp": 172, "kidney": 173, "kimchi": 174, "king": 175, "kiwifruit": 176, "kohlrabi": 177, "kumquats": 178, "lake": 179, "trout": 180, "lamb": 181, "lard": 182, "lavender": 183, "leeks": 184, "lemons": 185, "lentils": 186, "lettuce": 187, "lima": 188, "limes": 189, "lingonberries": 190, "liquor": 191, "liver": 192, "pã¢tã©": 193, "lobster": 194, "loganberries": 195, "long": 196, "low-fat": 197, "yogurt": 198, "macadamia": 199, "nut": 200, "maitake": 201, "mangoes": 202, "mangosteen": 203, "marionberrries": 204, "matã©": 205, "mayonnaise": 206, "meadow": 207, "saffron": 208, "melons": 209, "mint": 210, "mung": 211, "muskmelon": 212, "mussels": 213, "mutton": 214, "navy": 215, "oatmeal": 216, "oats": 217, "ohyo": 218, "olive": 219, "olives": 220, "oranges": 221, "oysters": 222, "seeds": 223, "paprika": 224, "parsley": 225, "partially-hydrogenated": 226, "passion": 227, "fruit": 228, "pã¢tã©s": 229, "paw": 230, "peaches": 231, "peanut": 232, "peanuts": 233, "pennyroyal": 234, "peppermint": 235, "pepperoni": 236, "persian": 237, "persipan": 238, "pesto": 239, "pickle": 240, "relish": 241, "pickled": 242, "watermelon": 243, "rind": 244, "pickles": 245, "pimento": 246, "pineapple": 247, "pink": 248, "peppercorns": 249, "pinto": 250, "pistachio": 251, "plantago": 252, "plantains": 253, "plums": 254, "pomegranate": 255, "juice": 256, "pomegranates": 257, "pork": 258, "portobello": 259, "potato": 260, "chips": 261, "poultry": 262, "powdered": 263, "sugar": 264, "prawns": 265, "prickly": 266, "probiotic": 267, "processed": 268, "soy": 269, "protein": 270, "prosciutto": 271, "bars": 272, "prunes": 273, "pumpkin": 274, "pumpkins": 275, "purple": 276, "sweet": 277, "radish": 278, "raisins": 279, "rapeseed": 280, "raspberries": 281, "kuri": 282, "mold": 283, "flakes": 284, "sage": 285, "spinach": 286, "wine": 287, "reishi": 288, "rhubarb": 289, "ribs": 290, "roast": 291, "roasted": 292, "roe": 293, "rolled": 294, "romaine": 295, "rosemary": 296, "rutabagas": 297, "rye": 298, "safflower": 299, "salmon": 300, "salt": 301, "salted": 302, "shrimp": 303, "sandwich": 304, "sardines": 305, "sauerkraut": 306, "sausages": 307, "scallions": 308, "scallops": 309, "seaweed": 310, "sesame": 311, "shallots": 312, "shellfish": 313, "shiitake": 314, "sichuan": 315, "smoked": 316, "turkey": 317, "snails": 318, "snap": 319, "snow": 320, "soba": 321, "noodles": 322, "infant": 323, "formula": 324, "isolate": 325, "soybean": 326, "soybeans": 327, "spaghetti": 328, "spearmint": 329, "split": 330, "steak": 331, "strawberries": 332, "string": 333, "sturgeon": 334, "subtropical": 335, "sucrose": 336, "summer": 337, "sunflower": 338, "tabasco": 339, "table": 340, "tahini": 341, "tallow": 342, "tangerines": 343, "tartary": 344, "tofu": 345, "tomato": 346, "tomatoes": 347, "tropical": 348, "turmeric": 349, "turnips": 350, "and": 351, "turnip": 352, "veal": 353, "wakame": 354, "walnut": 355, "walnuts": 356, "wasabi": 357, "watercress": 358, "well-done": 359, "wheat": 360, "germ": 361, "grass": 362, "white": 363, "button": 364, "whole": 365, "wild": 366, "winter": 367, "yams": 368, "yerba": 369, "zucchini": 370, "cup": 371, "dark": 372, "belgian": 373, "carree": 374, "marble": 375, "baller": 376, "popcorn": 377, "choc": 378, "pntbtr": 379, "mix": 380, "cake": 381, "yellow": 382, "praline": 383, "slabs": 384, "slab": 385, "knife": 386, "plastic": 387, "tissue": 388, "kettle": 389, "start": 390, "up": 391, "lit": 392}