{"<pad>": 0, "<unk>": 1, "about": 2, "acorn": 3, "adzuki": 4, "alcohol": 5, "algae": 6, "almond": 7, "almonds": 8, "anchovies": 9, "and": 10, "apple": 11, "apples": 12, "apricots": 13, "arctic": 14, "artichokes": 15, "arugula": 16, "asparagus": 17, "autumn": 18, "avocado": 19, "avocados": 20, "aã§aã­": 21, "bacon": 22, "baller": 23, "balsamic": 24, "bananas": 25, "barbecued": 26, "bars": 27, "basil": 28, "bean": 29, "beans": 30, "beef": 31, "beer": 32, "beets": 33, "belgian": 34, "bell": 35, "berries": 36, "bitter": 37, "black": 38, "blackberries": 39, "blackstrap": 40, "blue-green": 41, "blueberries": 42, "bok": 43, "boysenberries": 44, "bran": 45, "brazil": 46, "bread": 47, "broccoli": 48, "brown": 49, "brussels": 50, "buckwheat": 51, "butter": 52, "butternut": 53, "button": 54, "cabbage": 55, "cactus": 56, "cake": 57, "canola": 58, "cantaloupe": 59, "carree": 60, "carrots": 61, "cashews": 62, "cauliflower": 63, "caviar": 64, "cayenne": 65, "celeriac": 66, "celery": 67, "chamomile": 68, "char": 69, "cheese": 70, "cherries": 71, "chicken": 72, "chickpeas": 73, "chili": 74, "chilli": 75, "chinese": 76, "chips": 77, "chives": 78, "choc": 79, "chocolate": 80, "choy": 81, "cilantro": 82, "cinnamon": 83, "clams": 84, "clementines": 85, "coconut": 86, "coffee": 87, "collard": 88, "corn": 89, "crab": 90, "cranberries": 91, "cream": 92, "cress": 93, "crimini": 94, "crocus": 95, "cucumber": 96, "cucumbers": 97, "cumin": 98, "cup": 99, "curcumin": 100, "curd": 101, "cured": 102, "currants": 103, "daidzein": 104, "dal": 105, "dark": 106, "dill": 107, "dried": 108, "dry": 109, "edamame": 110, "eggs": 111, "equol": 112, "escargot": 113, "essiacâ„¢": 114, "fennel": 115, "fermented": 116, "flakes": 117, "flaxseed": 118, "formula": 119, "fried": 120, "fruit": 121, "garbanzo": 122, "garden": 123, "garlic": 124, "genistein": 125, "germ": 126, "ghee": 127, "ginger": 128, "gourd": 129, "grape": 130, "grapefruit": 131, "grapes": 132, "grass": 133, "gravy": 134, "green": 135, "greens": 136, "guacamole": 137, "halibut": 138, "ham": 139, "hearts": 140, "herring": 141, "holy": 142, "honey": 143, "honeydew": 144, "horseradish": 145, "hot": 146, "hummus": 147, "indian": 148, "infant": 149, "is": 150, "isolate": 151, "juice": 152, "kale": 153, "kefir": 154, "kelp": 155, "kettle": 156, "kidney": 157, "kimchi": 158, "king": 159, "kiwifruit": 160, "knife": 161, "kohlrabi": 162, "kumquats": 163, "kuri": 164, "lake": 165, "lamb": 166, "lard": 167, "lavender": 168, "leeks": 169, "lemons": 170, "lentils": 171, "lettuce": 172, "lima": 173, "limes": 174, "lingonberries": 175, "liquor": 176, "lit": 177, "liver": 178, "lobster": 179, "loganberries": 180, "long": 181, "low-fat": 182, "macadamia": 183, "mackerel": 184, "maitake": 185, "mangoes": 186, "mangosteen": 187, "marble": 188, "marionberrries": 189, "matã©": 190, "mayonnaise": 191, "me": 192, "meadow": 193, "meat": 194, "meats": 195, "melon": 196, "melons": 197, "milk": 198, "mint": 199, "mix": 200, "molasses": 201, "mold": 202, "mung": 203, "mushrooms": 204, "muskmelon": 205, "mussels": 206, "mustard": 207, "mutton": 208, "navy": 209, "noodles": 210, "nut": 211, "nuts": 212, "oatmeal": 213, "oats": 214, "of": 215, "ohyo": 216, "oil": 217, "olive": 218, "olives": 219, "onions": 220, "oranges": 221, "oysters": 222, "palm": 223, "papaya": 224, "paprika": 225, "parsley": 226, "partially-hydrogenated": 227, "passion": 228, "paste": 229, "paw": 230, "peaches": 231, "peanut": 232, "peanuts": 233, "pears": 234, "peas": 235, "pennyroyal": 236, "pepper": 237, "peppercorns": 238, "peppermint": 239, "pepperoni": 240, "peppers": 241, "persian": 242, "persipan": 243, "pesto": 244, "pickle": 245, "pickled": 246, "pickles": 247, "pimento": 248, "pineapple": 249, "pink": 250, "pinto": 251, "pistachio": 252, "plantago": 253, "plantains": 254, "plastic": 255, "plums": 256, "pntbtr": 257, "pomegranate": 258, "pomegranates": 259, "popcorn": 260, "pork": 261, "portobello": 262, "potato": 263, "potatoes": 264, "poultry": 265, "powder": 266, "powdered": 267, "praline": 268, "prawns": 269, "prickly": 270, "probiotic": 271, "processed": 272, "prosciutto": 273, "protein": 274, "prunes": 275, "pumpkin": 276, "pumpkins": 277, "purple": 278, "pã¢tã©": 279, "pã¢tã©s": 280, "radish": 281, "raisins": 282, "rapeseed": 283, "raspberries": 284, "red": 285, "reishi": 286, "relish": 287, "rhubarb": 288, "ribs": 289, "rice": 290, "rind": 291, "roast": 292, "roasted": 293, "roe": 294, "rolled": 295, "romaine": 296, "rosemary": 297, "rutabagas": 298, "rye": 299, "safflower": 300, "saffron": 301, "sage": 302, "salmon": 303, "salt": 304, "salted": 305, "sandwich": 306, "sardines": 307, "sauce": 308, "sauerkraut": 309, "sausages": 310, "scallions": 311, "scallops": 312, "seaweed": 313, "seed": 314, "seeds": 315, "sesame": 316, "shallots": 317, "shellfish": 318, "shiitake": 319, "shrimp": 320, "sichuan": 321, "slab": 322, "slabs": 323, "smoked": 324, "snails": 325, "snap": 326, "snow": 327, "soba": 328, "something": 329, "soy": 330, "soybean": 331, "soybeans": 332, "spaghetti": 333, "spearmint": 334, "spinach": 335, "split": 336, "sprouts": 337, "squash": 338, "start": 339, "steak": 340, "strawberries": 341, "string": 342, "sturgeon": 343, "subtropical": 344, "sucrose": 345, "sugar": 346, "summer": 347, "sunflower": 348, "sweet": 349, "syrup": 350, "tabasco": 351, "table": 352, "tahini": 353, "tallow": 354, "tangerines": 355, "tartary": 356, "tea": 357, "tell": 358, "tissue": 359, "tofu": 360, "tomato": 361, "tomatoes": 362, "tropical": 363, "trout": 364, "turkey": 365, "turmeric": 366, "turnip": 367, "turnips": 368, "up": 369, "veal": 370, "vinegar": 371, "wakame": 372, "walnut": 373, "walnuts": 374, "wasabi": 375, "watercress": 376, "watermelon": 377, "well-done": 378, "what": 379, "wheat": 380, "white": 381, "who": 382, "whole": 383, "wild": 384, "wine": 385, "winter": 386, "yams": 387, "yeast": 388, "yellow": 389, "yerba": 390, "yogurt": 391, "zucchini": 392}